//index.js
//获取应用实例
const app = getApp()

Page({
  data: {
    list: [
      {
        title: '吃',
        children: [
          '美食',
          '中餐',
          '快餐',
          '火锅',
          '咖啡厅',
          '肯德基',
          '自助餐',
          '小吃',
          '蛋糕房',
          '西餐',
          '川菜',
          '麦当劳',
          '海鲜',
          '日本料理',
          '湘菜',
          '韩国料理',
          '麻辣烫',
          '茶餐厅',
          '甜品店',
          '奶茶',
          '冷饮店',
          '必胜客',
          '早餐',
          '晚餐',
          '下午茶'
        ]
      },
      {
        title: '住',
        children: [
          '酒店',
          '快捷酒店',
          '宾馆',
          '青年旅社',
          '星级酒店',
          '旅馆',
          '主题酒店',
          '商务酒店',
          '招待所',
          '家庭旅馆',
          '公寓'
        ]
      },
      {
        title: '出行',
        children: [
          '公交站',
          '地铁站',
          '火车站',
          '汽车站',
          '飞机场',
          '停车场',
          '加油站',
          '加气站',
          '服务区',
          '火车票代理',
          '充电桩'
        ]
      },
      {
        title: '游',
        children: [
          '景点',
          '公园',
          '游乐场',
          '风景名胜',
          '博物馆',
          '寺庙',
          '植物园',
          '海洋馆',
          '动物园',
          '纪念馆',
          '水上乐园',
          '教堂',
          '森林公园',
          '主题公园',
          '5A景区',
          '4A景区',
          '湿地公园',
          '度假村'
        ]
      },
      {
        title: '银行',
        children: [
          '银行',
          'ATM',
          '建设银行',
          '工商银行',
          '农业银行',
          '中国银行',
          '招商银行',
          '邮政银行',
          '交通银行',
          '浦发银行',
          '民生银行',
          '邮储银行',
          '中信银行',
          '广大银行',
          '兴业银行',
          '平安银行',
          '北京银行',
          '广发银行'
        ]
      },
      {
        title: '购物',
        children: [
          '超市',
          '商场',
          '步行街',
          '五金店',
          '便利店',
          '书店',
          '菜市场',
          '花店',
          '眼镜店',
          '建材市场',
          '农贸市场',
          '渔具',
          '窗帘',
          '水果店'
        ]
      },
      {
        title: '休闲娱乐',
        children: [
          '洗浴',
          '网吧',
          '足疗',
          '电影院',
          'KTV',
          '夜店',
          '酒吧',
          '台球',
          '健身房',
          '游泳馆',
          '茶楼',
          '休闲会所',
          '棋牌室',
          '温泉',
          '水疗'
        ]
      },
      {
        title: '生活服务',
        children: [
          '厕所',
          '医院',
          '药店',
          '诊所',
          '汽车维修',
          '洗车',
          '汽车美容',
          '4s店',
          '理发店',
          '美容院',
          '移动营业厅',
          '联通营业厅',
          '电信营业厅',
          '邮局',
          '照相馆',
          '小学',
          '中学',
          '大学',
          '驾校',
          '打印',
          '旅行社',
          '派出所',
          '快递',
          '彩票',
          '房产中介',
          '宠物医院',
          '干洗店'
        ]
      },
    ]
  },
  onLoad: function () { }
})
